GopalSaraf/Practicals/PSDL/include/proc/pic16f15376.inc
#define LC3D3S2                          BANKMASK(CLC3SEL2), 2
#define LC3D3S3                          BANKMASK(CLC3SEL2), 3
#define LC3D3S4                          BANKMASK(CLC3SEL2), 4
#define LC3D3S5                          BANKMASK(CLC3SEL2), 5
#define LC3D4S0                          BANKMASK(CLC3SEL3), 0
#define LC3D4S1                          BANKMASK(CLC3SEL3), 1
#define LC3D4S2                          BANKMASK(CLC3SEL3), 2
#define LC3D4S3                          BANKMASK(CLC3SEL3), 3
#define LC3D4S4                          BANKMASK(CLC3SEL3), 4
#define LC3D4S5                          BANKMASK(CLC3SEL3), 5
#define LC3EN                            BANKMASK(CLC3CON), 7
#define LC3G1D1N                         BANKMASK(CLC3GLS0), 0
#define LC3G1D1T                         BANKMASK(CLC3GLS0), 1
#define LC3G1D2N                         BANKMASK(CLC3GLS0), 2
#define LC3G1D2T                         BANKMASK(CLC3GLS0), 3
#define LC3G1D3N                         BANKMASK(CLC3GLS0), 4
#define LC3G1D3T                         BANKMASK(CLC3GLS0), 5
#define LC3G1D4N                         BANKMASK(CLC3GLS0), 6
#define LC3G1D4T                         BANKMASK(CLC3GLS0), 7
#define LC3G1POL                         BANKMASK(CLC3POL), 0
#define LC3G2D1N                         BANKMASK(CLC3GLS1), 0
#define LC3G2D1T                         BANKMASK(CLC3GLS1), 1
#define LC3G2D2N                         BANKMASK(CLC3GLS1), 2
#define LC3G2D2T                         BANKMASK(CLC3GLS1), 3
#define LC3G2D3N                         BANKMASK(CLC3GLS1), 4
#define LC3G2D3T                         BANKMASK(CLC3GLS1), 5
#define LC3G2D4N                         BANKMASK(CLC3GLS1), 6
#define LC3G2D4T                         BANKMASK(CLC3GLS1), 7
#define LC3G2POL                         BANKMASK(CLC3POL), 1
#define LC3G3D1N                         BANKMASK(CLC3GLS2), 0
#define LC3G3D1T                         BANKMASK(CLC3GLS2), 1
#define LC3G3D2N                         BANKMASK(CLC3GLS2), 2
#define LC3G3D2T                         BANKMASK(CLC3GLS2), 3
#define LC3G3D3N                         BANKMASK(CLC3GLS2), 4
#define LC3G3D3T                         BANKMASK(CLC3GLS2), 5
#define LC3G3D4N                         BANKMASK(CLC3GLS2), 6
#define LC3G3D4T                         BANKMASK(CLC3GLS2), 7
#define LC3G3POL                         BANKMASK(CLC3POL), 2
#define LC3G4D1N                         BANKMASK(CLC3GLS3), 0
#define LC3G4D1T                         BANKMASK(CLC3GLS3), 1
#define LC3G4D2N                         BANKMASK(CLC3GLS3), 2
#define LC3G4D2T                         BANKMASK(CLC3GLS3), 3
#define LC3G4D3N                         BANKMASK(CLC3GLS3), 4
#define LC3G4D3T                         BANKMASK(CLC3GLS3), 5
#define LC3G4D4N                         BANKMASK(CLC3GLS3), 6
#define LC3G4D4T                         BANKMASK(CLC3GLS3), 7
#define LC3G4POL                         BANKMASK(CLC3POL), 3
#define LC3INTN                          BANKMASK(CLC3CON), 3
#define LC3INTP                          BANKMASK(CLC3CON), 4
#define LC3MODE0                         BANKMASK(CLC3CON), 0
#define LC3MODE1                         BANKMASK(CLC3CON), 1
#define LC3MODE2                         BANKMASK(CLC3CON), 2
#define LC3OUT                           BANKMASK(CLC3CON), 5
#define LC3POL                           BANKMASK(CLC3POL), 7
#define LC4D1S0                          BANKMASK(CLC4SEL0), 0
#define LC4D1S1                          BANKMASK(CLC4SEL0), 1
#define LC4D1S2                          BANKMASK(CLC4SEL0), 2
#define LC4D1S3                          BANKMASK(CLC4SEL0), 3
#define LC4D1S4                          BANKMASK(CLC4SEL0), 4
#define LC4D1S5                          BANKMASK(CLC4SEL0), 5
#define LC4D2S0                          BANKMASK(CLC4SEL1), 0
#define LC4D2S1                          BANKMASK(CLC4SEL1), 1
#define LC4D2S2                          BANKMASK(CLC4SEL1), 2
#define LC4D2S3                          BANKMASK(CLC4SEL1), 3
#define LC4D2S4                          BANKMASK(CLC4SEL1), 4
#define LC4D2S5                          BANKMASK(CLC4SEL1), 5
#define LC4D3S0                          BANKMASK(CLC4SEL2), 0
#define LC4D3S1                          BANKMASK(CLC4SEL2), 1
#define LC4D3S2                          BANKMASK(CLC4SEL2), 2
#define LC4D3S3                          BANKMASK(CLC4SEL2), 3
#define LC4D3S4                          BANKMASK(CLC4SEL2), 4
#define LC4D3S5                          BANKMASK(CLC4SEL2), 5
#define LC4D4S0                          BANKMASK(CLC4SEL3), 0
#define LC4D4S1                          BANKMASK(CLC4SEL3), 1
#define LC4D4S2                          BANKMASK(CLC4SEL3), 2
#define LC4D4S3                          BANKMASK(CLC4SEL3), 3
#define LC4D4S4                          BANKMASK(CLC4SEL3), 4
#define LC4D4S5                          BANKMASK(CLC4SEL3), 5
#define LC4EN                            BANKMASK(CLC4CON), 7
#define LC4G1D1N                         BANKMASK(CLC4GLS0), 0
#define LC4G1D1T                         BANKMASK(CLC4GLS0), 1
#define LC4G1D2N                         BANKMASK(CLC4GLS0), 2
#define LC4G1D2T                         BANKMASK(CLC4GLS0), 3
#define LC4G1D3N                         BANKMASK(CLC4GLS0), 4
#define LC4G1D3T                         BANKMASK(CLC4GLS0), 5
#define LC4G1D4N                         BANKMASK(CLC4GLS0), 6
#define LC4G1D4T                         BANKMASK(CLC4GLS0), 7
#define LC4G1POL                         BANKMASK(CLC4POL), 0
#define LC4G2D1N                         BANKMASK(CLC4GLS1), 0
#define LC4G2D1T                         BANKMASK(CLC4GLS1), 1
#define LC4G2D2N                         BANKMASK(CLC4GLS1), 2
#define LC4G2D2T                         BANKMASK(CLC4GLS1), 3
#define LC4G2D3N                         BANKMASK(CLC4GLS1), 4
#define LC4G2D3T                         BANKMASK(CLC4GLS1), 5
#define LC4G2D4N                         BANKMASK(CLC4GLS1), 6
#define LC4G2D4T                         BANKMASK(CLC4GLS1), 7
#define LC4G2POL                         BANKMASK(CLC4POL), 1
#define LC4G3D1N                         BANKMASK(CLC4GLS2), 0
#define LC4G3D1T                         BANKMASK(CLC4GLS2), 1
#define LC4G3D2N                         BANKMASK(CLC4GLS2), 2
#define LC4G3D2T                         BANKMASK(CLC4GLS2), 3
#define LC4G3D3N                         BANKMASK(CLC4GLS2), 4
#define LC4G3D3T                         BANKMASK(CLC4GLS2), 5
#define LC4G3D4N                         BANKMASK(CLC4GLS2), 6
#define LC4G3D4T                         BANKMASK(CLC4GLS2), 7
#define LC4G3POL                         BANKMASK(CLC4POL), 2
#define LC4G4D1N                         BANKMASK(CLC4GLS3), 0
#define LC4G4D1T                         BANKMASK(CLC4GLS3), 1
#define LC4G4D2N                         BANKMASK(CLC4GLS3), 2
#define LC4G4D2T                         BANKMASK(CLC4GLS3), 3
#define LC4G4D3N                         BANKMASK(CLC4GLS3), 4
#define LC4G4D3T                         BANKMASK(CLC4GLS3), 5
#define LC4G4D4N                         BANKMASK(CLC4GLS3), 6
#define LC4G4D4T                         BANKMASK(CLC4GLS3), 7
#define LC4G4POL                         BANKMASK(CLC4POL), 3
#define LC4INTN                          BANKMASK(CLC4CON), 3
#define LC4INTP                          BANKMASK(CLC4CON), 4
#define LC4MODE0                         BANKMASK(CLC4CON), 0
#define LC4MODE1                         BANKMASK(CLC4CON), 1
#define LC4MODE2                         BANKMASK(CLC4CON), 2
#define LC4OUT                           BANKMASK(CLC4CON), 5
#define LC4POL                           BANKMASK(CLC4POL), 7
#define LD                               BANKMASK(CWG1CON0), 6
#define LFOEN                            BANKMASK(OSCEN), 4
#define LFOR                             BANKMASK(OSCSTAT), 4
#define LSAC0                            BANKMASK(CWG1AS0), 2
#define LSAC1                            BANKMASK(CWG1AS0), 3
#define LSBD0                            BANKMASK(CWG1AS0), 4
#define LSBD1                            BANKMASK(CWG1AS0), 5
#define LWLO                             BANKMASK(NVMCON1), 5
#define MC1OUT                           BANKMASK(CMOUT), 0
#define MC2OUT                           BANKMASK(CMOUT), 1
#define MFOEN                            BANKMASK(OSCEN), 5
#define MFOR                             BANKMASK(OSCSTAT), 5
#define MLC1OUT                          BANKMASK(CLCDATA), 0
#define MLC2OUT                          BANKMASK(CLCDATA), 1
#define MLC3OUT                          BANKMASK(CLCDATA), 2
#define MLC4OUT                          BANKMASK(CLCDATA), 3
#define MODE4                            BANKMASK(T2HLT), 4
#define MSK01                            BANKMASK(SSP1ADD), 0
#define MSK02                            BANKMASK(SSP2ADD), 0
#define MSK11                            BANKMASK(SSP1ADD), 1
#define MSK12                            BANKMASK(SSP2ADD), 1
#define MSK21                            BANKMASK(SSP1ADD), 2
#define MSK22                            BANKMASK(SSP2ADD), 2
#define MSK31                            BANKMASK(SSP1ADD), 3
#define MSK32                            BANKMASK(SSP2ADD), 3
#define MSK41                            BANKMASK(SSP1ADD), 4
#define MSK42                            BANKMASK(SSP2ADD), 4
#define MSK51                            BANKMASK(SSP1ADD), 5
#define MSK52                            BANKMASK(SSP2ADD), 5
#define MSK61                            BANKMASK(SSP1ADD), 6
#define MSK62                            BANKMASK(SSP2ADD), 6
#define MSK71                            BANKMASK(SSP1ADD), 7
#define MSK72                            BANKMASK(SSP2ADD), 7
#define MSSP1MD                          BANKMASK(PMD4), 4
#define MSSP2MD                          BANKMASK(PMD4), 5
#define N1CKS0                           BANKMASK(NCO1CLK), 0
#define N1CKS1                           BANKMASK(NCO1CLK), 1
#define N1CKS2                           BANKMASK(NCO1CLK), 2
#define N1EN                             BANKMASK(NCO1CON), 7
#define N1OUT                            BANKMASK(NCO1CON), 5
#define N1PFM                            BANKMASK(NCO1CON), 0
#define N1POL                            BANKMASK(NCO1CON), 4
#define N1PWS0                           BANKMASK(NCO1CLK), 5
#define N1PWS1                           BANKMASK(NCO1CLK), 6
#define N1PWS2                           BANKMASK(NCO1CLK), 7
#define NCO1ACC0                         BANKMASK(NCO1ACCL), 0
#define NCO1ACC1                         BANKMASK(NCO1ACCL), 1
#define NCO1ACC10                        BANKMASK(NCO1ACCH), 2
#define NCO1ACC11                        BANKMASK(NCO1ACCH), 3
#define NCO1ACC12                        BANKMASK(NCO1ACCH), 4
#define NCO1ACC13                        BANKMASK(NCO1ACCH), 5
#define NCO1ACC14                        BANKMASK(NCO1ACCH), 6
#define NCO1ACC15                        BANKMASK(NCO1ACCH), 7
#define NCO1ACC16                        BANKMASK(NCO1ACCU), 0
#define NCO1ACC17                        BANKMASK(NCO1ACCU), 1
#define NCO1ACC18                        BANKMASK(NCO1ACCU), 2
#define NCO1ACC19                        BANKMASK(NCO1ACCU), 3
#define NCO1ACC2                         BANKMASK(NCO1ACCL), 2
#define NCO1ACC3                         BANKMASK(NCO1ACCL), 3
#define NCO1ACC4                         BANKMASK(NCO1ACCL), 4
#define NCO1ACC5                         BANKMASK(NCO1ACCL), 5
#define NCO1ACC6                         BANKMASK(NCO1ACCL), 6
#define NCO1ACC7                         BANKMASK(NCO1ACCL), 7
#define NCO1ACC8                         BANKMASK(NCO1ACCH), 0
#define NCO1ACC9                         BANKMASK(NCO1ACCH), 1
#define NCO1IE                           BANKMASK(PIE7), 4
#define NCO1IF                           BANKMASK(PIR7), 4
#define NCO1INC0                         BANKMASK(NCO1INCL), 0
#define NCO1INC1                         BANKMASK(NCO1INCL), 1
#define NCO1INC10                        BANKMASK(NCO1INCH), 2
#define NCO1INC11                        BANKMASK(NCO1INCH), 3
#define NCO1INC12                        BANKMASK(NCO1INCH), 4
#define NCO1INC13                        BANKMASK(NCO1INCH), 5
#define NCO1INC14                        BANKMASK(NCO1INCH), 6
#define NCO1INC15                        BANKMASK(NCO1INCH), 7
#define NCO1INC16                        BANKMASK(NCO1INCU), 0
#define NCO1INC17                        BANKMASK(NCO1INCU), 1
#define NCO1INC18                        BANKMASK(NCO1INCU), 2
#define NCO1INC19                        BANKMASK(NCO1INCU), 3
#define NCO1INC2                         BANKMASK(NCO1INCL), 2
#define NCO1INC3                         BANKMASK(NCO1INCL), 3
#define NCO1INC4                         BANKMASK(NCO1INCL), 4
#define NCO1INC5                         BANKMASK(NCO1INCL), 5
#define NCO1INC6                         BANKMASK(NCO1INCL), 6
#define NCO1INC7                         BANKMASK(NCO1INCL), 7
#define NCO1INC8                         BANKMASK(NCO1INCH), 0
#define NCO1INC9                         BANKMASK(NCO1INCH), 1
#define NCO1MD                           BANKMASK(PMD1), 7
#define NCOIE                            BANKMASK(PIE7), 4
#define NCOIF                            BANKMASK(PIR7), 4
#define NCOMD                            BANKMASK(PMD1), 7
#define NDIV0                            BANKMASK(OSCCON1), 0
#define NDIV1                            BANKMASK(OSCCON1), 1
#define NDIV2                            BANKMASK(OSCCON1), 2
#define NDIV3                            BANKMASK(OSCCON1), 3
#define NOSC0                            BANKMASK(OSCCON1), 4
#define NOSC1                            BANKMASK(OSCCON1), 5
#define NOSC2                            BANKMASK(OSCCON1), 6
#define NOSCR                            BANKMASK(OSCCON3), 3
#define NSS                              BANKMASK(DAC1CON0), 0
#define NVMADRH0                         BANKMASK(NVMADRH), 0
#define NVMADRH1                         BANKMASK(NVMADRH), 1
#define NVMADRH2                         BANKMASK(NVMADRH), 2
#define NVMADRH3                         BANKMASK(NVMADRH), 3
#define NVMADRH4                         BANKMASK(NVMADRH), 4
#define NVMADRH5                         BANKMASK(NVMADRH), 5
#define NVMADRH6                         BANKMASK(NVMADRH), 6
#define NVMADRL0                         BANKMASK(NVMADRL), 0
#define NVMADRL1                         BANKMASK(NVMADRL), 1
#define NVMADRL2                         BANKMASK(NVMADRL), 2
#define NVMADRL3                         BANKMASK(NVMADRL), 3
#define NVMADRL4                         BANKMASK(NVMADRL), 4
#define NVMADRL5                         BANKMASK(NVMADRL), 5
#define NVMADRL6                         BANKMASK(NVMADRL), 6
#define NVMADRL7                         BANKMASK(NVMADRL), 7
#define NVMDATH0                         BANKMASK(NVMDATH), 0
#define NVMDATH1                         BANKMASK(NVMDATH), 1
#define NVMDATH2                         BANKMASK(NVMDATH), 2
#define NVMDATH3                         BANKMASK(NVMDATH), 3
#define NVMDATH4                         BANKMASK(NVMDATH), 4
#define NVMDATH5                         BANKMASK(NVMDATH), 5
#define NVMDATL0                         BANKMASK(NVMDATL), 0
#define NVMDATL1                         BANKMASK(NVMDATL), 1
#define NVMDATL2                         BANKMASK(NVMDATL), 2
#define NVMDATL3                         BANKMASK(NVMDATL), 3
#define NVMDATL4                         BANKMASK(NVMDATL), 4
#define NVMDATL5                         BANKMASK(NVMDATL), 5
#define NVMDATL6                         BANKMASK(NVMDATL), 6
#define NVMDATL7                         BANKMASK(NVMDATL), 7
#define NVMIE                            BANKMASK(PIE7), 5
#define NVMIF                            BANKMASK(PIR7), 5
#define NVMMD                            BANKMASK(PMD0), 2
#define NVMREGS                          BANKMASK(NVMCON1), 6
#define ODCA0                            BANKMASK(ODCONA), 0
#define ODCA1                            BANKMASK(ODCONA), 1
#define ODCA2                            BANKMASK(ODCONA), 2
#define ODCA3                            BANKMASK(ODCONA), 3
#define ODCA4                            BANKMASK(ODCONA), 4
#define ODCA5                            BANKMASK(ODCONA), 5
#define ODCA6                            BANKMASK(ODCONA), 6
#define ODCA7                            BANKMASK(ODCONA), 7
#define ODCB0                            BANKMASK(ODCONB), 0
#define ODCB1                            BANKMASK(ODCONB), 1
#define ODCB2                            BANKMASK(ODCONB), 2
#define ODCB3                            BANKMASK(ODCONB), 3
#define ODCB4                            BANKMASK(ODCONB), 4
#define ODCB5                            BANKMASK(ODCONB), 5
#define ODCB6                            BANKMASK(ODCONB), 6
#define ODCB7                            BANKMASK(ODCONB), 7
#define ODCC0                            BANKMASK(ODCONC), 0
#define ODCC1                            BANKMASK(ODCONC), 1
#define ODCC2                            BANKMASK(ODCONC), 2
#define ODCC3                            BANKMASK(ODCONC), 3
#define ODCC4                            BANKMASK(ODCONC), 4
#define ODCC5                            BANKMASK(ODCONC), 5
#define ODCC6                            BANKMASK(ODCONC), 6
#define ODCC7                            BANKMASK(ODCONC), 7
#define ODCD0                            BANKMASK(ODCOND), 0
#define ODCD1                            BANKMASK(ODCOND), 1
#define ODCD2                            BANKMASK(ODCOND), 2
#define ODCD3                            BANKMASK(ODCOND), 3
#define ODCD4                            BANKMASK(ODCOND), 4
#define ODCD5                            BANKMASK(ODCOND), 5
#define ODCD6                            BANKMASK(ODCOND), 6
#define ODCD7                            BANKMASK(ODCOND), 7
#define ODCE0                            BANKMASK(ODCONE), 0
#define ODCE1                            BANKMASK(ODCONE), 1
#define ODCE2                            BANKMASK(ODCONE), 2
#define OE1                              BANKMASK(DAC1CON0), 5
#define OE2                              BANKMASK(DAC1CON0), 4
#define ORDY                             BANKMASK(OSCCON3), 4
#define OSFIE                            BANKMASK(PIE1), 7
#define OSFIF                            BANKMASK(PIR1), 7
#define OUTPS0                           BANKMASK(T2CON), 0
#define OUTPS1                           BANKMASK(T2CON), 1
#define OUTPS2                           BANKMASK(T2CON), 2
#define OUTPS3                           BANKMASK(T2CON), 3
#define OVRA                             BANKMASK(CWG1STR), 4
#define OVRB                             BANKMASK(CWG1STR), 5
#define OVRC                             BANKMASK(CWG1STR), 6
#define OVRD                             BANKMASK(CWG1STR), 7
#define PEIE                             BANKMASK(INTCON), 6
#define PEN1                             BANKMASK(SSP1CON2), 2
#define PEN2                             BANKMASK(SSP2CON2), 2
#define PLLR                             BANKMASK(OSCSTAT), 0
#define POLA                             BANKMASK(CWG1CON1), 0
#define POLB                             BANKMASK(CWG1CON1), 1
#define POLC                             BANKMASK(CWG1CON1), 2
#define POLD                             BANKMASK(CWG1CON1), 3
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0
#define PSCNT0                           BANKMASK(WDTPSL), 0
#define PSCNT1                           BANKMASK(WDTPSL), 1
#define PSCNT10                          BANKMASK(WDTPSH), 2
#define PSCNT11                          BANKMASK(WDTPSH), 3
#define PSCNT12                          BANKMASK(WDTPSH), 4
#define PSCNT13                          BANKMASK(WDTPSH), 5
#define PSCNT14                          BANKMASK(WDTPSH), 6
#define PSCNT15                          BANKMASK(WDTPSH), 7
#define PSCNT16                          BANKMASK(WDTTMR), 0
#define PSCNT17                          BANKMASK(WDTTMR), 1
#define PSCNT2                           BANKMASK(WDTPSL), 2
#define PSCNT3                           BANKMASK(WDTPSL), 3
#define PSCNT4                           BANKMASK(WDTPSL), 4
#define PSCNT5                           BANKMASK(WDTPSL), 5
#define PSCNT6                           BANKMASK(WDTPSL), 6
#define PSCNT7                           BANKMASK(WDTPSL), 7
#define PSCNT8                           BANKMASK(WDTPSH), 0
#define PSCNT9                           BANKMASK(WDTPSH), 1
#define PSS0                             BANKMASK(DAC1CON0), 2
#define PSS1                             BANKMASK(DAC1CON0), 3
#define PSYNC                            BANKMASK(T2HLT), 7
#define PWM3DC0                          BANKMASK(PWM3DCL), 6
#define PWM3DC1                          BANKMASK(PWM3DCL), 7
#define PWM3DC2                          BANKMASK(PWM3DCH), 0
#define PWM3DC3                          BANKMASK(PWM3DCH), 1
#define PWM3DC4                          BANKMASK(PWM3DCH), 2
#define PWM3DC5                          BANKMASK(PWM3DCH), 3
#define PWM3DC6                          BANKMASK(PWM3DCH), 4
#define PWM3DC7                          BANKMASK(PWM3DCH), 5
#define PWM3DC8                          BANKMASK(PWM3DCH), 6
#define PWM3DC9                          BANKMASK(PWM3DCH), 7
#define PWM3EN                           BANKMASK(PWM3CON), 7
#define PWM3MD                           BANKMASK(PMD3), 2
#define PWM3OUT                          BANKMASK(PWM3CON), 5
#define PWM3POL                          BANKMASK(PWM3CON), 4
#define PWM4DC0                          BANKMASK(PWM4DCL), 6
#define PWM4DC1                          BANKMASK(PWM4DCL), 7
#define PWM4DC2                          BANKMASK(PWM4DCH), 0
#define PWM4DC3                          BANKMASK(PWM4DCH), 1
#define PWM4DC4                          BANKMASK(PWM4DCH), 2
#define PWM4DC5                          BANKMASK(PWM4DCH), 3
#define PWM4DC6                          BANKMASK(PWM4DCH), 4
#define PWM4DC7                          BANKMASK(PWM4DCH), 5
#define PWM4DC8                          BANKMASK(PWM4DCH), 6
#define PWM4DC9                          BANKMASK(PWM4DCH), 7
#define PWM4EN                           BANKMASK(PWM4CON), 7
#define PWM4MD                           BANKMASK(PMD3), 3
#define PWM4OUT                          BANKMASK(PWM4CON), 5
#define PWM4POL                          BANKMASK(PWM4CON), 4
#define PWM5DC0                          BANKMASK(PWM5DCL), 6
#define PWM5DC1                          BANKMASK(PWM5DCL), 7
#define PWM5DC2                          BANKMASK(PWM5DCH), 0
#define PWM5DC3                          BANKMASK(PWM5DCH), 1
#define PWM5DC4                          BANKMASK(PWM5DCH), 2
#define PWM5DC5                          BANKMASK(PWM5DCH), 3
#define PWM5DC6                          BANKMASK(PWM5DCH), 4
#define PWM5DC7                          BANKMASK(PWM5DCH), 5
#define PWM5DC8                          BANKMASK(PWM5DCH), 6
#define PWM5DC9                          BANKMASK(PWM5DCH), 7
#define PWM5EN                           BANKMASK(PWM5CON), 7
#define PWM5MD                           BANKMASK(PMD3), 4
#define PWM5OUT                          BANKMASK(PWM5CON), 5
#define PWM5POL                          BANKMASK(PWM5CON), 4
#define PWM6DC0                          BANKMASK(PWM6DCL), 6
#define PWM6DC1                          BANKMASK(PWM6DCL), 7
#define PWM6DC2                          BANKMASK(PWM6DCH), 0
#define PWM6DC3                          BANKMASK(PWM6DCH), 1
#define PWM6DC4                          BANKMASK(PWM6DCH), 2
#define PWM6DC5                          BANKMASK(PWM6DCH), 3
#define PWM6DC6                          BANKMASK(PWM6DCH), 4
#define PWM6DC7                          BANKMASK(PWM6DCH), 5
#define PWM6DC8                          BANKMASK(PWM6DCH), 6
#define PWM6DC9                          BANKMASK(PWM6DCH), 7
#define PWM6EN                           BANKMASK(PWM6CON), 7
